### WORKING WITH DATAFRAME'S COLUMNS

we have two dataframe with identical schema. Our aim is to identify difference in the two tables and subsequently merge and discard repeated or shared rows by the dataframes. Dataframe 1 is named "data" and dataframe 2 is named data1. Meaningful information were extracted from the dataframes.

In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
import plotly.express as px
%matplotlib inline

In [2]:
pd.set_option('display.max_columns', None)

In [3]:
%%HTML
<style type=""text/CSS"">
table.dataframe td, table.dataframe th {
    border: 1px red solid !important;
    color: green !important;
}
</style>

In [4]:
# Create the first dataframe
set1 = {
    "Loyalt":[1,0,1,1,1,1,1,1,1,0,1,1,1,0,1,0,1,1,1,1,1,0,0,1,1,1,1],
    "Spen": [0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,60,100,50,30,90,35,90,104,43,23,19,34,20,123,30,40,75,0.0,0.0],
    "Aged":[20,30,22,54,34,56,36,37,29,19,42,45,25,56,34,23,56,23,78,23,44,23,34,12,32,26,35]}

df = pd.DataFrame(set1)
df.head()

   Loyalt  Spen  Aged
0       1   0.0    20
1       0   0.0    30
2       1   0.0    22
3       1   0.0    54
4       1   0.0    34

In [5]:
# sum rows and columns
df.shape

(27, 3)

In [6]:
# show columns
df.columns

Index(['Loyalt', 'Spen', 'Aged'], dtype='object')

In [7]:
# Rename multiple columns
data = df.rename(columns = {'Loyalt': 'loyalty', 'Spen':'Spent','Aged':'age'})
data.head()

   loyalty  Spent  age
0        1    0.0   20
1        0    0.0   30
2        1    0.0   22
3        1    0.0   54
4        1    0.0   34

In [8]:
# Convert columns to lower case
data.columns = data.columns.str.lower().str.replace(' ', '_')
data.head()

   loyalty  spent  age
0        1    0.0   20
1        0    0.0   30
2        1    0.0   22
3        1    0.0   54
4        1    0.0   34

In [9]:
data.columns

Index(['loyalty', 'spent', 'age'], dtype='object')

In [10]:
age_count = data.age.value_counts(ascending = False)
age_count.head()

23    4
34    3
56    3
20    1
45    1
Name: age, dtype: int64

In [11]:
#data['Spent'] = data['spent'].astype(str).astype(float)

In [12]:
#Show the difference of loyalty
agediff = data.loyalty.diff()
agediff.head()

0    NaN
1   -1.0
2    1.0
3    0.0
4    0.0
Name: loyalty, dtype: float64

In [13]:
# show difference between the first row
dw = data.diff(axis=0)
dw.head()

   loyalty  spent   age
0      NaN    NaN   NaN
1     -1.0    0.0  10.0
2      1.0    0.0  -8.0
3      0.0    0.0  32.0
4      0.0    0.0 -20.0

In [14]:
# show difference between the columns
diff_col = data.diff(axis=1)
diff_col.head()

   loyalty  spent   age
0      NaN   -1.0  20.0
1      NaN    0.0  30.0
2      NaN   -1.0  22.0
3      NaN   -1.0  54.0
4      NaN   -1.0  34.0

In [15]:
# difference between the first 2 row 
diff_row = data.diff(periods=2)
diff_row.head()

   loyalty  spent   age
0      NaN    NaN   NaN
1      NaN    NaN   NaN
2      0.0    0.0   2.0
3      1.0    0.0  24.0
4      0.0    0.0  12.0

### Second dataframe

In [16]:
# Create a dataframe

set2 = {
    "Loyalt":[1,0,1,1,0,1,1,1,1,0,1,1,1,0,1,0,1,1,1,1,1,0,0,1,1,1,1, 3],
    "Spen": [0.0,200,30,0.0,0.0,0.0,80,0.0,60,100,50,30,90,35,90,104,43,23,19,34,20,123,30,40,75,0.0,0.0, 400],
    "Aged":[20,30,70,54,34,56,36,37,29,20,42,45,25,56,34,23,56,23,78,56,44,23,34,12,32,26,35, 100]
}

df1 = pd.DataFrame(set2)
df1.head()

   Loyalt   Spen  Aged
0       1    0.0    20
1       0  200.0    30
2       1   30.0    70
3       1    0.0    54
4       0    0.0    34

In [17]:
df1.shape

(28, 3)

In [18]:
# Rename multiple columns
data1 = df1.rename(columns = {'Loyalt': 'loyalty', 'Spen':'spent','Aged':'age'})
data1.head()

   loyalty  spent  age
0        1    0.0   20
1        0  200.0   30
2        1   30.0   70
3        1    0.0   54
4        0    0.0   34

In [19]:
age_count = data1.age.value_counts(ascending = False)
age_count.head()

56    4
34    3
23    3
20    2
25    1
Name: age, dtype: int64

### Working with the 2 Dataframes

In [20]:
# dataframe "data" columns is equal to data1 columns
data.columns = data1.columns

# Set each column as index
data.set_index(data.columns.tolist())
data1.set_index(data1.columns.tolist())

# show the difference between the column age in the dataframes
print(data.index.difference(data.spent))
print(data1.index.difference(data1.spent))

Int64Index([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16, 17,
            18, 21, 22, 24, 25, 26],
           dtype='int64')
Int64Index([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16, 17,
            18, 21, 22, 24, 25, 26, 27],
           dtype='int64')

In [21]:
# Only show data that don't exist in both dataframe of all rows that don't exist on both df1 and df2.
exist = pd.merge(data.spent, data1.spent, how='outer', indicator='Exist')
exist = exist.loc[exist['Exist'] != 'both']
exist

    spent       Exist
93  200.0  right_only
94   80.0  right_only
95  400.0  right_only

In [22]:
# show data that don't exist in both dataframe.
exist1 = pd.merge(data, data1, how='outer', indicator='Exist')
exist1 = exist1.loc[exist1['Exist'] != 'both']
exist1

    loyalty  spent  age       Exist
1         0    0.0   30   left_only
2         1    0.0   22   left_only
4         1    0.0   34   left_only
6         1    0.0   36   left_only
9         0  100.0   19   left_only
19        1   34.0   23   left_only
27        0  200.0   30  right_only
28        1   30.0   70  right_only
29        0    0.0   34  right_only
30        1   80.0   36  right_only
31        0  100.0   20  right_only
32        1   34.0   56  right_only
33        3  400.0  100  right_only